rottenpotatoes/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "title" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Some Movie"], ["director", "Some Director"], ["updated_at", "2015-11-26 00:54:00.994660"], ["id", 21]]

  def director
    @movie = Movie.find params[:id]

    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'hilite'
    end
    if params[:sort] != session[:sort]
      session[:sort] = sort
      redirect_to :sort => sort and return
    end

    @selected_director = @movie.director

    if ""== @selected_director then redirect_to movies_path end
    flash[:notice] = "'#{@movie.title}' has no director info."




    @movies = Movie.where(director: @selected_director).order(ordering)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Robin Williams"]]