hw4/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "title" = ?, "director" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Star Wars"], ["director", "George Lucas"], ["release_date", "2015-05-25 00:00:00.000000"], ["updated_at", "2015-11-26 19:54:36.944071"], ["id", 22]]

  def director
    @movie = Movie.find params[:id]
    @selected_director = @movie.director

    if ""== @selected_director then
      redirect_to movies_path
      flash[:notice] = "'#{@movie.title}' has no director info."
    end

    @movies = Movie.where(director: @selected_director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Robin Williams"]]